garyPenhook/PIC-Assembler/Microchip.PIC18F-Q_DFP.1.28.451.atpack_FILES/edc/PIC18F05Q41.PIC
        <edc:SFRDef edc:access="--rr--nn" edc:cname="VREGCON" edc:desc="" edc:impl="0x33" edc:isindirect="false" edc:isvolatile="true" edc:mclr="--qq--10" edc:name="VREGCON" edc:nzwidth="8" edc:por="--qq--10" edc:_addr="0x48">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="VREGPM" edc:mask="0x3" edc:name="VREGPM" edc:nzwidth="2"/>
              <edc:AdjustPoint edc:offset="0x2"/>
              <edc:SFRFieldDef edc:cname="PMSYS" edc:mask="0x3" edc:name="PMSYS" edc:nzwidth="0x2"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="VREGPM0" edc:mask="0x1" edc:name="VREGPM0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="VREGPM1" edc:mask="0x1" edc:name="VREGPM0" edc:nzwidth="0x1"/>
              <edc:AdjustPoint edc:offset="0x2"/>
              <edc:SFRFieldDef edc:cname="PMSYS0" edc:mask="0x1" edc:name="PMSYS0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="PMSYS1" edc:mask="0x1" edc:name="PMSYS1" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="n------r" edc:cname="BORCON" edc:desc="" edc:impl="0x81" edc:isindirect="false" edc:isvolatile="true" edc:mclr="u------u" edc:name="BORCON" edc:nzwidth="8" edc:por="1------q" edc:_addr="0x49">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="BORRDY" edc:mask="0x1" edc:name="BORRDY" edc:nzwidth="0x1"/>
              <edc:AdjustPoint edc:offset="6"/>
              <edc:SFRFieldDef edc:cname="SBOREN" edc:mask="0x1" edc:name="SBOREN" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="n-rr--nn" edc:cname="HLVDCON0" edc:desc="" edc:impl="0xb3" edc:isindirect="false" edc:isvolatile="true" edc:mclr="0-xx--00" edc:name="HLVDCON0" edc:nzwidth="8" edc:por="0-xx--00" edc:_modsrc="DOS-02611_lvd_ctrl_v6_xxK40_8Bit.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0x2" edc:_addr="0x4A">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="INTL" edc:mask="0x1" edc:name="INTL" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="INTH" edc:mask="0x1" edc:name="INTH" edc:nzwidth="0x1"/>
              <edc:AdjustPoint edc:offset="0x2"/>
              <edc:SFRFieldDef edc:cname="RDY" edc:mask="0x1" edc:name="RDY" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="OUT" edc:mask="0x1" edc:name="OUT" edc:nzwidth="0x1"/>
              <edc:AdjustPoint edc:offset="0x1"/>
              <edc:SFRFieldDef edc:cname="EN" edc:mask="0x1" edc:name="EN" edc:nzwidth="0x1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="HLVDINTL" edc:mask="0x1" edc:name="HLVDINTL" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="HLVDINTH" edc:mask="0x1" edc:name="HLVDINTH" edc:nzwidth="0x1"/>
              <edc:AdjustPoint edc:offset="0x2"/>
              <edc:SFRFieldDef edc:cname="HLVDRDY" edc:mask="0x1" edc:name="HLVDRDY" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="HLVDOUT" edc:mask="0x1" edc:name="HLVDOUT" edc:nzwidth="0x1"/>
              <edc:AdjustPoint edc:offset="0x1"/>
              <edc:SFRFieldDef edc:cname="HLVDEN" edc:mask="0x1" edc:name="HLVDEN" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="----nnnn" edc:cname="HLVDCON1" edc:desc="" edc:impl="0xf" edc:isindirect="false" edc:isvolatile="true" edc:mclr="----uuuu" edc:name="HLVDCON1" edc:nzwidth="8" edc:por="----0000" edc:_modsrc="DOS-02611_lvd_ctrl_v6_xxK40_8Bit.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0x2" edc:_addr="0x4B">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="SEL" edc:mask="0xf" edc:name="SEL" edc:nzwidth="4"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="SEL0" edc:mask="0x1" edc:name="SEL0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SEL1" edc:mask="0x1" edc:name="SEL0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SEL2" edc:mask="0x1" edc:name="SEL0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SEL3" edc:mask="0x1" edc:name="SEL0" edc:nzwidth="0x1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.1">
              <edc:SFRFieldDef edc:cname="HLVDSEL0" edc:mask="0x1" edc:name="HLVDSEL0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="HLVDSEL1" edc:mask="0x1" edc:name="HLVDSEL0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="HLVDSEL2" edc:mask="0x1" edc:name="HLVDSEL0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="HLVDSEL3" edc:mask="0x1" edc:name="HLVDSEL0" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="n-rn--nn" edc:cname="ZCDCON" edc:desc="ZERO CROSS DETECT CONTROL REGISTER" edc:impl="0xb3" edc:isindirect="false" edc:isvolatile="true" edc:mclr="0-x0--00" edc:name="ZCDCON" edc:nzwidth="8" edc:por="0-x0--00" edc:_modsrc="DOS-02702_cmp_zxover_ctrl_v2.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0x1" edc:_addr="0x4C">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="INTN" edc:desc="Zero-Cross Detect Negative-going Edge Interrupt Enable" edc:mask="0x1" edc:name="INTN" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="INTP" edc:desc="Zero-Cross Detect Positive-going Edge Interrupt Enable" edc:mask="0x1" edc:name="INTP" edc:nzwidth="1"/>
              <edc:AdjustPoint edc:offset="2"/>
              <edc:SFRFieldDef edc:cname="POL" edc:desc="Zero-Cross Detect Polarity bit" edc:mask="0x1" edc:name="POL" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="OUT" edc:desc="Zero-Cross Detect Data Output" edc:mask="0x1" edc:name="OUT" edc:nzwidth="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:SFRFieldDef edc:cname="SEN" edc:desc="Zero-Cross Detect Software Enable bit" edc:mask="0x1" edc:name="SEN" edc:nzwidth="1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="ZCDINTN" edc:mask="0x1" edc:name="ZCDINTN" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="ZCDINTP" edc:mask="0x1" edc:name="ZCDINTP" edc:nzwidth="0x1"/>
              <edc:AdjustPoint edc:offset="0x2"/>
              <edc:SFRFieldDef edc:cname="ZCDPOL" edc:mask="0x1" edc:name="ZCDPOL" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="ZCDOUT" edc:mask="0x1" edc:name="ZCDOUT" edc:nzwidth="0x1"/>
              <edc:AdjustPoint edc:offset="0x1"/>
              <edc:SFRFieldDef edc:cname="ZCDSEN" edc:mask="0x1" edc:name="ZCDSEN" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:AdjustPoint edc:offset="0x16" edc:_addr="0x4D"/>
        <edc:SFRDef edc:access="nnnnn-nn" edc:cname="PMD0" edc:desc="" edc:impl="0x20" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00000-00" edc:name="PMD0" edc:nzwidth="8" edc:por="00000-00" edc:_modsrc="DOS-02264_pmd_mid8_v1-Q41.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0x6" edc:_addr="0x63">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="IOCMD" edc:desc="" edc:mask="0x1" edc:name="IOCMD" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="CLKRMD" edc:desc="" edc:mask="0x1" edc:name="CLKRMD" edc:nzwidth="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:SFRFieldDef edc:cname="SCANMD" edc:desc="" edc:mask="0x1" edc:name="SCANMD" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="CRCMD" edc:desc="" edc:mask="0x1" edc:name="CRCMD" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="LVDMD" edc:mask="0x1" edc:name="LVDMD" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="FVRMD" edc:desc="" edc:mask="0x1" edc:name="FVRMD" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="SYSCMD" edc:desc="" edc:mask="0x1" edc:name="SYSCMD" edc:nzwidth="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
