garyPenhook/PIC-Assembler/Microchip.PIC18F-Q_DFP.1.28.451.atpack_FILES/edc/PIC18F05Q41.PIC
        <edc:SFRDef edc:access="nn---n--" edc:cname="U1UIR" edc:desc="" edc:impl="0xc4" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00---0--" edc:name="U1UIR" edc:nzwidth="8" edc:por="00---0--" edc:_modsrc="DOS-03076_uart_protocol_0_v1.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0x13" edc:_addr="0x2B1">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:AdjustPoint edc:offset="2"/>
              <edc:SFRFieldDef edc:cname="ABDIE" edc:desc="" edc:mask="0x1" edc:name="ABDIE" edc:nzwidth="1"/>
              <edc:AdjustPoint edc:offset="3"/>
              <edc:SFRFieldDef edc:cname="ABDIF" edc:desc="" edc:mask="0x1" edc:name="ABDIF" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="WUIF" edc:desc="" edc:mask="0x1" edc:name="WUIF" edc:nzwidth="1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:AdjustPoint edc:offset="2"/>
              <edc:SFRFieldDef edc:cname="U1ABDIE" edc:desc="" edc:mask="0x1" edc:name="U1ABDIE" edc:nzwidth="1"/>
              <edc:AdjustPoint edc:offset="3"/>
              <edc:SFRFieldDef edc:cname="U1ABDIF" edc:desc="" edc:mask="0x1" edc:name="U1ABDIF" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="U1WUIF" edc:desc="" edc:mask="0x1" edc:name="U1WUIF" edc:nzwidth="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="nnnnnnnn" edc:cname="U1ERRIR" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="10000000" edc:name="U1ERRIR" edc:nzwidth="8" edc:por="10000000" edc:_modsrc="DOS-03076_uart_protocol_0_v1.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0x13" edc:_addr="0x2B2">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="TXCIF" edc:desc="" edc:mask="0x1" edc:name="TXCIF" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="RXFOIF" edc:desc="" edc:mask="0x1" edc:name="RXFOIF" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="RXBKIF" edc:desc="" edc:mask="0x1" edc:name="RXBKIF" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="FERIF" edc:desc="" edc:mask="0x1" edc:name="FERIF" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="CERIF" edc:desc="" edc:mask="0x1" edc:name="CERIF" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="ABDOVF" edc:desc="" edc:mask="0x1" edc:name="ABDOVF" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="PERIF" edc:desc="" edc:mask="0x1" edc:name="PERIF" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="TXMTIF" edc:desc="" edc:mask="0x1" edc:name="TXMTIF" edc:nzwidth="1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="U1TXCIF" edc:desc="" edc:mask="0x1" edc:name="U1TXCIF" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="U1RXFOIF" edc:desc="" edc:mask="0x1" edc:name="U1RXFOIF" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="U1RXBKIF" edc:desc="" edc:mask="0x1" edc:name="U1RXBKIF" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="U1FERIF" edc:desc="" edc:mask="0x1" edc:name="U1FERIF" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="U1CERIF" edc:desc="" edc:mask="0x1" edc:name="U1CERIF" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="U1ABDOVF" edc:desc="" edc:mask="0x1" edc:name="U1ABDOVF" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="U1PERIF" edc:desc="" edc:mask="0x1" edc:name="U1PERIF" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="U1TXMTIF" edc:desc="" edc:mask="0x1" edc:name="U1TXMTIF" edc:nzwidth="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="nnnnnnnn" edc:cname="U1ERRIE" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00000000" edc:name="U1ERRIE" edc:nzwidth="8" edc:por="00000000" edc:_modsrc="DOS-03076_uart_protocol_0_v1.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0x13" edc:_addr="0x2B3">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="TXCIE" edc:desc="" edc:mask="0x1" edc:name="TXCIE" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="RXFOIE" edc:desc="" edc:mask="0x1" edc:name="RXFOIE" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="RXBKIE" edc:desc="" edc:mask="0x1" edc:name="RXBKIE" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="FERIE" edc:desc="" edc:mask="0x1" edc:name="FERIE" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="CERIE" edc:desc="" edc:mask="0x1" edc:name="CERIE" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="ABDOVE" edc:desc="" edc:mask="0x1" edc:name="ABDOVE" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="PERIE" edc:desc="" edc:mask="0x1" edc:name="PERIE" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="TXMTIE" edc:desc="" edc:mask="0x1" edc:name="TXMTIE" edc:nzwidth="1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="U1TXCIE" edc:desc="" edc:mask="0x1" edc:name="U1TXCIE" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="U1RXFOIE" edc:desc="" edc:mask="0x1" edc:name="U1RXFOIE" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="U1RXBKIE" edc:desc="" edc:mask="0x1" edc:name="U1RXBKIE" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="U1FERIE" edc:desc="" edc:mask="0x1" edc:name="U1FERIE" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="U1CERIE" edc:desc="" edc:mask="0x1" edc:name="U1CERIE" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="U1ABDOVE" edc:desc="" edc:mask="0x1" edc:name="U1ABDOVE" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="U1PERIE" edc:desc="" edc:mask="0x1" edc:name="U1PERIE" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="U1TXMTIE" edc:desc="" edc:mask="0x1" edc:name="U1TXMTIE" edc:nzwidth="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="rrrrrrrr" edc:cname="U2RXB" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00000000" edc:name="U2RXB" edc:nzwidth="8" edc:por="00000000" edc:_modsrc="DOS-03076_uart_protocol_0_v1.Module" edc:_refcount="2" edc:_begin="0x0" edc:_end="0x13" edc:_addr="0x2B4">
          <edc:AliasList>
            <edc:MigrationAlias edc:cname="U2RXBL"/>
          </edc:AliasList>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="RXB" edc:desc="" edc:mask="0xff" edc:name="RXB" edc:nzwidth="8"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
